{
  "about_intro_text": "¡Hola! Soy Fravelz. Desde que era niño me han gustado e interesado el mundo de la informática y el desarrollo de software, especialmente el desarrollo web.",
  "about_history_text": "A los 9 años (2017) recibí mi primera computadora. Al principio la usaba para ver series en YouTube, pero todo cambió cuando descubrí La Geekipedia de Ernesto. Gracias a su canal comencé a aprender Java y pronto logré crear mis primeras interfaces gráficas.",
  "about_current_text": "Soy desarrollador frontend especializado en maquetación web, creando interfaces fluidas, animadas, funcionales y minimalistas. Trabajo con el buen uso de la semántica y el SEO, integro datos y servicios del backend en el frontend, y también me enfoco en la correcta estructuración y mantenimiento del código frontend.",
  "about_modal_title": "Continuación - Mi Historia",
  "about_modal_paragraph1": "También exploré otros de sus cursos, como el de Python y Raptor, lo que me llevó a encontrar aún más recursos y ganas de aprender. Hoy, tras casi 8 años desde ese primer contacto (año 2025), recuerdo todo como si fuera ayer. Aprender informática fue una parte enorme de mi infancia. Aunque a lo largo de los años he explorado áreas muy diferentes y he olvidado muchas cosas, siguen en mí recuerdos vagos de lo aprendido. Me pasa como a los adultos cuando olvidan detalles de su niñez: en mi caso, tengo retazos de conocimientos de informática que aún me acompañan.",
  "about_modal_paragraph2": "Las áreas que he explorado son muy variadas: ciencia de datos (pandas, numpy), inteligencia artificial (TensorFlow, Keras), desarrollo web (HTML, CSS, JS, React), desarrollo móvil (Flutter), desarrollo de escritorio (PyQt, Tkinter) y programación competitiva (C, C++), hacking/ciberseguridad (bash, python, linux, etc.). También he aprendido distintos lenguajes: Python, JavaScript, Java, C, C++, Go, Ruby, (.bat) y algunos más. Actualmente me concentro principalmente en el desarrollo web.",
  "about_modal_paragraph3": "Como dice el dicho, 'el que mucho abarca poco aprieta': he olvidado gran parte de lo que aprendí, aunque aún conservo algunos recuerdos sueltos. En el futuro, cuando logre algo más de estabilidad, me gustaría volver a programar en algunas de esas tecnologías. Aprovecharé mis proyectos antiguos de GitHub (algunos bastante desactualizados, como apps en Flutter o experimentos varios) para retomarlos y actualizarlos, y así transformarlos en parte de mi portafolio actual, como prueba de todo mi aprendizaje más allá de lo laboral.",
  "about_modal_paragraph4": "Por cierto, mi cuenta de GitHub actual es relativamente reciente (ya va para tres años), pero tuve una anterior vinculada a un correo que no era mío y la perdí. Aunque no la usaba tanto, decidí resubir aquí los proyectos antiguos, algunos incluso con mejoras. Pienso seguir actualizando ese legado para que forme parte de mi historia y refleje mi evolución como persona y como profesional."
}
