{
  "about_intro_text": "Привет! Я Fravelz, энтузиаст технологий и программирования. С детства меня увлекал мир информатики и разработки ПО, особенно веб-разработка.",
  "about_history_text": "В 9 лет (2017) я получил свой первый компьютер. Сначала я в основном использовал его для просмотра сериалов на YouTube, но всё изменилось в тот день, когда я обнаружил La Geekipedia de Ernesto. Благодаря его каналу я начал изучать Java и вскоре создал свои первые графические интерфейсы.",
  "about_current_text": "Сейчас я сосредотачиваюсь на full-stack веб-разработке, создавая современные и адаптивные приложения. Я специализируюсь на React, JavaScript и проектировании привлекательных и функциональных пользовательских интерфейсов.",
  "about_modal_title": "Продолжение — моя история",
  "about_modal_paragraph1": "Я также проходил другие его курсы, например по Python и Raptor, что помогло мне найти ещё больше ресурсов и желание учиться. Сегодня, спустя почти 8 лет с того первого знакомства (2025 год), я помню всё так, будто это было вчера. Изучение информатики сыграло огромную роль в моём детстве. Хотя за эти годы я пробовал себя в самых разных областях и многое забыл, в памяти всё ещё остаются смутные воспоминания о том, чему я научился. Со мной происходит то же, что и со взрослыми, когда они забывают детали своего детства: в моём случае у меня остались отдельные фрагменты знаний по информатике, которые до сих пор со мной.",
  "about_modal_paragraph2": "Области, которые я изучал, очень разнообразны: анализ данных (pandas, numpy), искусственный интеллект (TensorFlow, Keras), веб-разработка (HTML, CSS, JS, React), мобильная разработка (Flutter), разработка настольных приложений (PyQt, Tkinter) и спортивное программирование (C, C++), хакинг/кибербезопасность (bash, python, linux и т.д.). Я также изучал разные языки: Python, JavaScript, Java, C, C++, Go, Ruby, (.bat) и некоторые другие. В настоящее время я сосредоточен в основном на веб-разработке.",
  "about_modal_paragraph3": "Как говорится, 'за всё берёшься — ничего не успеваешь': я забыл большую часть того, что изучал, хотя всё ещё сохраняю некоторые разрозненные воспоминания. В будущем, когда добьюсь чуть большей стабильности, хотел бы снова программировать на некоторых из этих технологий. Я использую свои старые проекты на GitHub (некоторые довольно устарели, например приложения на Flutter или различные эксперименты), чтобы вернуться к ним и обновить, и таким образом превратить их в часть моего текущего портфолио, как доказательство всего моего обучения помимо работы.",
  "about_modal_paragraph4": "Кстати, мой нынешний аккаунт на GitHub относительно новый (ему почти три года), но раньше у меня был другой, привязанный к чужой почте, и я его потерял. Хотя я пользовался им не слишком активно, решил перезалить старые проекты сюда, некоторые даже с улучшениями. Я планирую продолжать обновлять это наследие, чтобы оно стало частью моей истории и отражало мою эволюцию как человека и как профессионала."
}
