{
  "change_language": "Change page language",
  "ir_abajo": "Go Down",
  "proyectos_personales": "Personal Projects",
  "autor": "Author",
  "hola": "Hello :v, how are you?",
  "futuro_pentester": "Future Web Pentester :)",
  "hero_logo_alt": "Fravelz logo",
  "hero_location": "Bogotá, Colombia",
  "hero_copy_success": "✓ Copied!",
  "selector_musica": "Music Selector",
  "pausar": "Pause",
  "reproducir": "Play",
  "cancion_chopin": "Piano - Chopin",
  "cancion_maluma": "Maluma - Hawaii",
  "cancion_bernes": "Mark Bernes - Dark Night",
  "cancion_bbno": "BBNO$ - Meant to be",
  "cancion_skai": "SKAI - Good Luck",
  "cert_section_title": "Certifications In Progress",
  "cert_ejpt_short": "eJPT",
  "cert_ejpt_full": "Ethical Junior Penetration Tester",
  "cert_ejpt_org": "INE Cybersecurity",
  "cert_ejpt_desc": "Junior pentesting certification covering networks, Linux, Windows and basic techniques.",
  "cert_ejpt_cost_usd": "$250 USD",
  "cert_ejpt_cost_cop": "~750k - 1M COP",
  "cert_ejpt_meta": "2026",
  "cert_oscp_short": "OSCP",
  "cert_oscp_full": "Offensive Security Certified Professional",
  "cert_oscp_org": "Offensive Security",
  "cert_oscp_desc": "Highly-regarded advanced pentesting certification covering exploitation and privilege escalation.",
  "cert_oscp_cost_usd": "$999 USD",
  "cert_oscp_cost_cop": "~3M - 4M COP",
  "cert_oscp_meta": "2027+",
  "cert_status_inprogress": "In Progress",
  "cert_status_future": "Future",
  "cert_cost_label": "Approx. cost:",
  "cert_goal_label": "Goal:",
  "cert_view_completed": "View Completed Certificates",
  "cert_completed_title": "Completed Certificates",
  "cert_view_all": "View All",
  "cert_click_to_view": "Click to view →",
  "cert_no_certificates": "No certificates for this filter",
  "cert_intro_paragraph1": "My training is self-taught; I dedicate at least four hours every day to study, including practice, review, reading, and new learning. I have trained with academies such as Marcelo Vázquez's (Savitar, Hack4u) and Martín Frías's (Hixec), investing hours of practice and learning with platforms like Hack The Box (HTB), TryHackMe, Pentester Academy, among others. HTB in particular stands out for its sites and resources, even free ones, that train people in cybersecurity and ethical hacking from the basics to labs that simulate real environments.",
  "cert_intro_paragraph2": "I do not yet hold official certifications, but one of the most recognized (at the junior level) and accessible ones ($250 USD, roughly 750,000–1,000,000 Colombian pesos) is the eJPT, which I plan to obtain in 2026.",
  "info_title": "Information",
  "info_certifications_title": "Certifications & Training",
  "info_about_title": "About Me",
  "info_about_subtitle": "My Story",
  "info_currently_subtitle": "Currently",
  "info_hobbies_title": "Hobbies",
  "info_more_info": "More information",
  "tech_title": "Technologies",
  "tech_basic_title": "Basics",
  "tech_basic_desc": "Basic OSINT, Anonymity and Privacy, Networks, Linux and Windows",
  "tech_automation_title": "Automation & Scripting",
  "tech_automation_desc": "Python, Bash Scripts",
  "tech_network_title": "Networks & Security",
  "tech_network_desc": "Nmap, Network Analysis",
  "tech_web_title": "Web",
  "tech_web_desc": "...",
  "hacking_projects_title": "Main Projects - Hacking",
  "hacking_notes_link": "View Project →",
  "hacking_ctf_coming": "Coming Soon",
  "other_projects_title": "Other Projects",
  "other_webhyprdots_link": "View Project →",
  "about_intro_text": "Hi! I'm Fravelz, a technology and programming enthusiast. Since I was a kid I've been fascinated by computers, cybersecurity, and software development.",
  "about_history_text": "At age 9 (2017) I received my first computer. I mostly used it to watch TV shows on YouTube, but everything changed the day I discovered La Geekipedia de Ernesto. Thanks to that channel, I started learning Java and soon built my first graphical interfaces.",
  "about_current_text": "I am currently focusing on frontend web development for personal projects and on ethical hacking as career preparation. Although hacking has always interested me, I am now returning to it with greater discipline and focus.",
  "about_modal_title": "Continuation - My Story",
  "about_modal_paragraph1": "I also explored his other courses, like Python and Raptor, which led me to even more resources and motivation to keep learning. Today, almost eight years after that first contact (year 2025), I remember everything as if it were yesterday. Learning about computers was a huge part of my childhood. Even though over the years I've explored very different areas and forgotten many things, I still carry faint memories of what I learned. It's like adults forgetting the details of their childhood; in my case, I keep fragments of computing knowledge that still stay with me.",
  "about_modal_paragraph2": "Hacking has always caught my attention, but because of the difficulty, technical jargon, and the limited resources I had back then, I explored other areas within computing.",
  "about_modal_paragraph3": "The areas I've explored are wide-ranging: data science (pandas, numpy), artificial intelligence (TensorFlow, Keras), hacking, web development (HTML, CSS, JS), mobile development (Flutter), desktop development (PyQt, Tkinter), and competitive programming (C, C++). I've also learned different languages: Python, JavaScript, Java, C, C++, Go, Ruby, (.bat), and a few more.",
  "about_modal_paragraph4": "As the saying goes, 'jack of all trades, master of none.' I've forgotten a good part of what I learned, although some loose memories remain. In the future, once I have a bit more stability, I'd like to code again in some of those technologies. I'll revisit my older GitHub projects (some quite outdated, like Flutter apps or various experiments), refresh them, and turn them into part of my current portfolio as proof of everything I've learned beyond formal work.",
  "about_modal_paragraph5": "By the way, my current GitHub account is relatively recent (almost three years old), but I used to have one linked to an email that wasn't mine and I lost it. Even though I didn't use it much, I decided to upload those old projects here, some even with improvements. I plan to keep updating that legacy so it becomes part of my story and reflects how I've grown as a person and as a professional.",
  "hobbies_exercise": "Exercise and calisthenics",
  "hobbies_piano": "Playing piano",
  "hobbies_webdev": "Developing web projects",
  "hobbies_linux": "Customizing my Arch Linux OS",
  "hobbies_typing_label": "Typing practice (35-50 WPM)",
  "hobbies_typing_link": "Monkeytype",
  "other_webhyprdots_title": "Web Hyprdots",
  "other_webhyprdots_desc": "Personal web portfolio with Hyprland configuration. Modern, responsive and fully customized design.",
  "other_arch_title": "Arch Linux Setup",
  "other_arch_desc": "Customized Arch Linux configuration with Hyprland, automation scripts and optimized dotfiles.",
  "other_notes_title": "Life Notes",
  "other_notes_desc": "Application for managing personal notes. Organization system, advanced search and integration.",
  "other_politics_title": "Political Project",
  "other_politics_desc": "Analysis and opinions on current political issues. Deep research and multiple perspectives.",
  "other_webhyprdots_link": "View Project →",
  "hacking_notes_title": "Hacking Notes",
  "hacking_notes_desc": "Complete collection of tools, techniques and methodologies for penetration testing.",
  "hacking_ctf_title": "CTF Challenges",
  "hacking_ctf_desc": "Detailed solutions to Capture The Flag challenges from multiple platforms.",
  "hacking_tool_title": "Custom Tool",
  "hacking_tool_desc": "Description of your custom hacking tool.",
  "hacking_analysis_title": "Vulnerability Analysis",
  "hacking_analysis_desc": "In-depth analysis of vulnerabilities found with reports and PoC.",
  "hacking_notes_link": "View Project →",
  "hacking_projects_title": "Main Hacking Projects",
  "hacking_ctf_coming": "Coming Soon"
}
