{
  "change_language": "Cambiar idioma de la página",
  "ir_abajo": "Ir Abajo",
  "proyectos_personales": "Proyectos Personales",
  "autor": "Autor",
  "hola": "Hola :v, ¿qué tal?",
  "futuro_pentester": "Futuro Pentester Web :)",
  "hero_logo_alt": "Logo de Fravelz",
  "hero_location": "Bogotá, Colombia",
  "hero_copy_success": "✓ ¡Copiado!",
  "selector_musica": "Selector de música",
  "pausar": "Pausar",
  "reproducir": "Reproducir",
  "cancion_chopin": "Piano - Chopin",
  "cancion_maluma": "Maluma - Hawái",
  "cancion_bernes": "Mark Bernes - Noche Oscura",
  "cancion_bbno": "BBNO$ - Meant to be",
  "cancion_skai": "SKAI - Buena Suerte",
  "cert_section_title": "Certificaciones en Progreso",
  "cert_ejpt_short": "eJPT",
  "cert_ejpt_full": "Ethical Junior Penetration Tester",
  "cert_ejpt_org": "INE Cybersecurity",
  "cert_ejpt_desc": "Certificación junior de pentesting ético: redes, Linux, Windows y técnicas básicas.",
  "cert_ejpt_cost_usd": "$250 USD",
  "cert_ejpt_cost_cop": "~750k - 1M COP",
  "cert_ejpt_meta": "2026",
  "cert_oscp_short": "OSCP",
  "cert_oscp_full": "Offensive Security Certified Professional",
  "cert_oscp_org": "Offensive Security",
  "cert_oscp_desc": "Certificación avanzada de pentesting que cubre explotación, escalada de privilegios y técnicas avanzadas.",
  "cert_oscp_cost_usd": "$999 USD",
  "cert_oscp_cost_cop": "~3M - 4M COP",
  "cert_oscp_meta": "2027+",
  "cert_status_inprogress": "En Progreso",
  "cert_status_future": "Futuro",
  "cert_cost_label": "Costo aproximado:",
  "cert_goal_label": "Meta:",
  "cert_view_completed": "Ver Certificados Completados",
  "cert_completed_title": "Certificados Completados",
  "cert_view_all": "Ver Todos",
  "cert_click_to_view": "Haz clic para ver →",
  "cert_no_certificates": "No hay certificados para este filtro",
  "cert_intro_paragraph1": "Mi formación es autodidacta; dedico un mínimo de 4 horas diarias al estudio que incluye práctica, repaso, lectura y aprendizaje nuevo. He pasado por academias como la de Marcelo Vázquez (Savitar, Hack4u) y la de Martín Frías (Hixec), sumando horas de práctica y aprendizaje con plataformas como Hack The Box (HTB), TryHackMe, Pentester Academy, entre otras. Especialmente HTB, por sus sitios y recursos, incluso gratuitos, que capacitan en ciberseguridad y hacking ético desde lo básico hasta laboratorios que simulan entornos reales.",
  "cert_intro_paragraph2": "Aún no cuento con certificaciones oficiales, pero una de las más reconocidas (a nivel junior) y accesibles ($250 USD, aproximadamente 750.000-1.000.000 pesos colombianos) es la eJPT, que planeo obtener en 2026.",
  "info_title": "Información",
  "info_certifications_title": "Certificaciones & Formación",
  "info_about_title": "Sobre Mí",
  "info_about_subtitle": "Mi Historia",
  "info_currently_subtitle": "Actualmente",
  "info_hobbies_title": "Pasatiempos",
  "info_more_info": "Más información",
  "tech_title": "Tecnologías",
  "tech_basic_title": "Bases & Básico",
  "tech_basic_desc": "OSINT básico, anonimato y privacidad, redes, Linux y Windows",
  "tech_automation_title": "Automatización & Scripting",
  "tech_automation_desc": "Python, Bash Script",
  "tech_network_title": "Redes, Seguridad y Más",
  "tech_network_desc": "Nmap, análisis de redes",
  "tech_web_title": "Web",
  "tech_web_desc": "...",
  "hacking_projects_title": "Proyectos Principales - Hacking",
  "hacking_notes_link": "Ver Proyecto →",
  "hacking_ctf_coming": "Próximamente",
  "other_projects_title": "Otros Proyectos",
  "other_webhyprdots_link": "Ver Proyecto →",
  "about_intro_text": "¡Hola! Soy Fravelz, un entusiasta de la tecnología y la programación. Desde que era niño, me ha gustado e interesado el mundo de la informática, la ciberseguridad y el desarrollo de software.",
  "about_history_text": "A los 9 años (2017) recibí mi primera computadora. Al principio la usaba para ver series en YouTube, pero todo cambió cuando descubrí La Geekipedia de Ernesto. Gracias a su canal comencé a aprender Java y pronto logré crear mis primeras interfaces gráficas.",
  "about_current_text": "Actualmente me enfoco en el desarrollo web frontend para proyectos personales y en el hacking ético como preparación laboral. Aunque el hacking siempre me interesó, ahora lo retomo con mayor disciplina y enfoque.",
  "about_modal_title": "Continuación - Mi Historia",
  "about_modal_paragraph1": "También exploré otros de sus cursos, como el de Python y Raptor, lo que me llevó a encontrar aún más recursos y ganas de aprender. Hoy, tras casi 8 años desde ese primer contacto (año 2025), recuerdo todo como si fuera ayer. Aprender informática fue una parte enorme de mi infancia. Aunque a lo largo de los años he explorado áreas muy diferentes y he olvidado muchas cosas, siguen en mí recuerdos vagos de lo aprendido. Me pasa como a los adultos cuando olvidan detalles de su niñez: en mi caso, tengo retazos de conocimientos de informática que aún me acompañan.",
  "about_modal_paragraph2": "Siempre me ha llamado la atención el hacking, pero por la dificultad, el tecnicismo y los recursos limitados en aquel entonces, fui explorando otros campos dentro de la informática.",
  "about_modal_paragraph3": "Las áreas que he explorado son muy variadas: ciencia de datos (pandas, numpy), inteligencia artificial (TensorFlow, Keras), hacking, desarrollo web (HTML, CSS, JS), desarrollo móvil (Flutter), desarrollo de escritorio (PyQt, Tkinter) y programación competitiva (C, C++). También he aprendido distintos lenguajes: Python, JavaScript, Java, C, C++, Go, Ruby, (.bat) y algunos más.",
  "about_modal_paragraph4": "Como dice el dicho, 'el que mucho abarca poco aprieta': he olvidado gran parte de lo que aprendí, aunque aún conservo algunos recuerdos sueltos. En el futuro, cuando logre algo más de estabilidad, me gustaría volver a programar en algunas de esas tecnologías. Aprovecharé mis proyectos antiguos de GitHub (algunos bastante desactualizados, como apps en Flutter o experimentos varios) para retomarlos y actualizarlos, y así transformarlos en parte de mi portfolio actual, como prueba de todo mi aprendizaje más allá de lo laboral.",
  "about_modal_paragraph5": "Por cierto, mi cuenta de GitHub actual es relativamente reciente (ya va para tres años), pero tuve una anterior vinculada a un correo que no era mío y la perdí. Aunque no la usaba tanto, decidí resubir aquí los proyectos antiguos, algunos incluso con mejoras. Pienso seguir actualizando ese legado para que forme parte de mi historia y refleje mi evolución como persona y como profesional.",
  "hobbies_exercise": "Ejercicio y calistenia",
  "hobbies_piano": "Tocar piano",
  "hobbies_webdev": "Desarrollar proyectos web",
  "hobbies_linux": "Personalizar mi sistema operativo Arch Linux",
  "hobbies_typing_label": "Mecanografía (35-50 PPM)",
  "hobbies_typing_link": "Monkeytype",
  "other_webhyprdots_title": "Web Hyprdots",
  "other_webhyprdots_desc": "Portafolio web personal con configuración de Hyprland. Diseño moderno, responsivo y totalmente personalizado.",
  "other_arch_title": "Arch Linux Setup",
  "other_arch_desc": "Configuración personalizada de Arch Linux con Hyprland, scripts de automatización y dotfiles optimizados.",
  "other_notes_title": "Notas de Vida",
  "other_notes_desc": "Aplicación para gestionar notas personales. Sistema de organización, búsqueda avanzada e integración.",
  "other_politics_title": "Proyecto Político",
  "other_politics_desc": "Análisis y opiniones sobre temas políticos actuales. Investigación profunda y perspectivas múltiples.",
  "other_webhyprdots_link": "Ver Proyecto →",
  "hacking_notes_title": "Notas de Hacking",
  "hacking_notes_desc": "Recopilación completa de herramientas, técnicas y metodologías para pruebas de penetración.",
  "hacking_ctf_title": "CTF Challenges",
  "hacking_ctf_desc": "Soluciones detalladas de desafíos Capture The Flag de múltiples plataformas.",
  "hacking_tool_title": "Herramienta Personalizada",
  "hacking_tool_desc": "Descripción de tu herramienta de hacking personalizada.",
  "hacking_analysis_title": "Análisis de Vulnerabilidades",
  "hacking_analysis_desc": "Análisis profundo de vulnerabilidades encontradas con reportes y PoC.",
  "hacking_notes_link": "Ver Proyecto →",
  "hacking_projects_title": "Proyectos Principales - Hacking",
  "hacking_ctf_coming": "Próximamente"
}
