{
  "change_language": "Изменить язык страницы",
  "ir_abajo": "Вниз",
  "proyectos_personales": "Личные проекты",
  "autor": "Автор",
  "hola": "Привет :v, как дела?",
  "futuro_pentester": "Будущий веб-пентестер :)",
  "hero_logo_alt": "Логотип Fravelz",
  "hero_location": "Богота, Колумбия",
  "hero_copy_success": "✓ Скопировано!",
  "selector_musica": "Выбор музыки",
  "pausar": "Пауза",
  "reproducir": "Воспроизвести",
  "cancion_chopin": "Фортепиано - Шопен",
  "cancion_maluma": "Малума - Гавайи",
  "cancion_bernes": "Марк Бернес - Тёмная ночь",
  "cancion_bbno": "BBNO$ - Meant to be",
  "cancion_skai": "SKAI - Удача",
  "cert_section_title": "Сертификаты в процессе",
  "cert_ejpt_short": "eJPT",
  "cert_ejpt_full": "Ethical Junior Penetration Tester",
  "cert_ejpt_org": "INE Cybersecurity",
  "cert_ejpt_desc": "Начальный сертификат по этичному пентестингу: сети, Linux, Windows и базовые техники.",
  "cert_ejpt_cost_usd": "$250 USD",
  "cert_ejpt_cost_cop": "~750k - 1M COP",
  "cert_ejpt_meta": "2026",
  "cert_oscp_short": "OSCP",
  "cert_oscp_full": "Offensive Security Certified Professional",
  "cert_oscp_org": "Offensive Security",
  "cert_oscp_desc": "Продвинутый сертификат по пентестингу, включает эксплуатацию уязвимостей и повышение привилегий.",
  "cert_oscp_cost_usd": "$999 USD",
  "cert_oscp_cost_cop": "~3M - 4M COP",
  "cert_oscp_meta": "2027+",
  "cert_status_inprogress": "В процессе",
  "cert_status_future": "Будет",
  "cert_cost_label": "Примерная стоимость:",
  "cert_goal_label": "Цель:",
  "cert_view_completed": "Просмотреть выполненные сертификаты",
  "cert_completed_title": "Выполненные сертификаты",
  "cert_view_all": "Показать все",
  "cert_click_to_view": "Нажмите, чтобы посмотреть →",
  "cert_no_certificates": "Нет сертификатов для этого фильтра",
  "cert_intro_paragraph1": "Я обучаюсь самостоятельно, уделяя учебе минимум 4 часа каждый день, включая практику, повторение, чтение и освоение нового материала. Я проходил обучение в академиях Марсело Васкеса (Savitar, Hack4u) и Мартина Фриаса (Hixec), проводя много часов за практикой и учебой на платформах Hack The Box (HTB), TryHackMe, Pentester Academy и других. Особенно ценю HTB за их сайты и ресурсы, включая бесплатные, которые обучают кибербезопасности и этичному хакингу — от базы до лабораторий, моделирующих реальные среды.",
  "cert_intro_paragraph2": "У меня пока нет официальных сертификатов, но одним из самых известных и доступных (для уровня Junior) является eJPT (250 долларов США, примерно 750 000–1 000 000 колумбийских песо), который я планирую получить в 2026 году.",
  "info_title": "Информация",
  "info_certifications_title": "Сертификаты и обучение",
  "info_about_title": "Обо мне",
  "info_about_subtitle": "Моя история",
  "info_currently_subtitle": "В настоящее время",
  "info_hobbies_title": "Увлечения",
  "info_more_info": "Подробнее",
  "tech_title": "Технологии",
  "tech_basic_title": "Основы",
  "tech_basic_desc": "Базовый OSINT, Анонимность и Приватность, Сети, Linux и Windows",
  "tech_automation_title": "Автоматизация и Скриптинг",
  "tech_automation_desc": "Python, Bash скрипты",
  "tech_network_title": "Сети и Безопасность",
  "tech_network_desc": "Nmap, Анализ сетей",
  "tech_web_title": "Web",
  "tech_web_desc": "...",
  "hacking_projects_title": "Основные Проекты - Хакинг",
  "hacking_notes_link": "Посмотреть Проект →",
  "hacking_ctf_coming": "Скоро",
  "other_projects_title": "Другие Проекты",
  "other_webhyprdots_link": "Посмотреть Проект →",
  "about_intro_text": "Привет! Я Fravelz, энтузиаст технологий и программирования. С детства меня увлекал мир информатики, кибербезопасности и разработки ПО.",
  "about_history_text": "В 9 лет (2017) я получил свой первый компьютер. Сначала я в основном использовал его для просмотра сериалов на YouTube, но всё изменилось в тот день, когда я обнаружил La Geekipedia de Ernesto. Благодаря его каналу я начал изучать Java и вскоре создал свои первые графические интерфейсы.",
  "about_current_text": "Сейчас я сосредотачиваюсь на фронтенд веб-разработке для личных проектов и этичном хакинге как подготовке к работе. Хотя хакинг всегда меня интересовал, теперь я возвращаюсь к нему с большей дисциплиной и фокусом.",
  "about_modal_title": "Продолжение — моя история",
  "about_modal_paragraph1": "Я также проходил другие его курсы, например по Python и Raptor, что помогло мне найти новые ресурсы и придало ещё больше мотивации учиться. Сегодня, спустя почти 8 лет с того первого знакомства (2025 год), я помню всё так, будто это было вчера. Изучение информатики сыграло огромную роль в моём детстве. За эти годы я пробовал себя в самых разных областях и многое успел забыть, но в памяти всё ещё остаются смутные воспоминания о том, чему я научился. Это как у взрослых, которые забывают детали своего детства: у меня остались отдельные фрагменты знаний по информатике, которые до сих пор со мной.",
  "about_modal_paragraph2": "Меня всегда привлекал хакинг, но из-за сложности, специфической терминологии и ограниченных ресурсов в то время я переключался на другие области внутри информатики.",
  "about_modal_paragraph3": "Области, которые я изучал, очень разнообразны: анализ данных (pandas, numpy), искусственный интеллект (TensorFlow, Keras), хакинг, веб-разработка (HTML, CSS, JS), мобильная разработка (Flutter), разработка настольных приложений (PyQt, Tkinter) и спортивное программирование (C, C++). Я также изучал разные языки: Python, JavaScript, Java, C, C++, Go, Ruby, (.bat) и другие.",
  "about_modal_paragraph4": "Как говорится, за всё берёшься — ничего не успеваешь: большую часть того, что я изучал, я уже забыл, хотя некоторые фрагменты всё ещё помню. В будущем, когда добьюсь большей стабильности, хочу вернуться к некоторым из этих технологий. Я воспользуюсь своими старыми проектами на GitHub (некоторые из них довольно устарели, например приложения на Flutter или разные эксперименты), чтобы доработать и обновить их, превратив в часть моего текущего портфолио как подтверждение обучения вне работы.",
  "about_modal_paragraph5": "Кстати, мой нынешний аккаунт на GitHub относительно новый (ему почти три года), но раньше у меня был другой, привязанный к чужой почте, и я его потерял. Хотя я пользовался им не слишком активно, решил перезалить проекты сюда, некоторые даже улучшил. Планирую продолжать обновлять это наследие, чтобы оно стало частью моей истории и показывало моё развитие как человека и как профессионала.",
  "hobbies_exercise": "Упражнения и каллистеника",
  "hobbies_piano": "Игра на пианино",
  "hobbies_webdev": "Разработка веб-проектов",
  "hobbies_linux": "Кастомизация моей ОС Arch Linux",
  "hobbies_typing_label": "Механическая печать (35-50 слов в минуту)",
  "hobbies_typing_link": "Monkeytype",
  "other_webhyprdots_title": "Web Hyprdots",
  "other_webhyprdots_desc": "Личный веб-портфель с конфигурацией Hyprland. Современный, отзывчивый и полностью настраиваемый дизайн.",
  "other_arch_title": "Настройка Arch Linux",
  "other_arch_desc": "Настраиваемая конфигурация Arch Linux с Hyprland, скрипты автоматизации и оптимизированные dotfiles.",
  "other_notes_title": "Жизненные заметки",
  "other_notes_desc": "Приложение для управления личными заметками. Система организации, расширенный поиск и интеграция.",
  "other_politics_title": "Политический проект",
  "other_politics_desc": "Анализ и мнения по актуальным политическим вопросам. Глубокое исследование и множественные перспективы.",
  "other_webhyprdots_link": "Посмотреть проект →",
  "hacking_notes_title": "Заметки о хакинге",
  "hacking_notes_desc": "Полная коллекция инструментов, методов и методологий для тестирования проникновения.",
  "hacking_ctf_title": "CTF Challenges",
  "hacking_ctf_desc": "Подробные решения задач Capture The Flag с различных платформ.",
  "hacking_tool_title": "Пользовательский инструмент",
  "hacking_tool_desc": "Описание вашего пользовательского инструмента для хакинга.",
  "hacking_analysis_title": "Анализ уязвимостей",
  "hacking_analysis_desc": "Глубокий анализ найденных уязвимостей с отчетами и PoC.",
  "hacking_notes_link": "Посмотреть проект →",
  "hacking_projects_title": "Основные проекты хакинга",
  "hacking_ctf_coming": "Скоро"
}
