{
  "about_intro_text": "Hi! I'm Fravelz. Since I was a kid I've been fascinated by computers and software development, especially web development.",
  "about_history_text": "At age 9 (2017) I received my first computer. I mostly used it to watch TV shows on YouTube, but everything changed the day I discovered La Geekipedia de Ernesto. Thanks to that channel, I started learning Java and soon built my first graphical interfaces.",
  "about_current_text": "I am currently a frontend developer specialized in web layout, creation of fluid, animated and minimalist designs, semantics and web SEO, and structuring and maintenance of frontend code. I focus on creating modern and responsive applications, and specialize in React, JavaScript and designing attractive and functional user interfaces.",
  "about_modal_title": "Continuation - My Story",
  "about_modal_paragraph1": "I also explored his other courses, like Python and Raptor, which led me to find even more resources and motivation to learn. Today, almost 8 years after that first contact (year 2025), I remember everything as if it were yesterday. Learning computing was a huge part of my childhood. Although over the years I've explored very different areas and forgotten many things, I still have vague memories of what I learned. It's like adults forgetting the details of their childhood: in my case, I have fragments of computing knowledge that still accompany me.",
  "about_modal_paragraph2": "The areas I've explored are very varied: data science (pandas, numpy), artificial intelligence (TensorFlow, Keras), web development (HTML, CSS, JS, React), mobile development (Flutter), desktop development (PyQt, Tkinter) and competitive programming (C, C++), hacking/cybersecurity (bash, python, linux, etc.). I've also learned different languages: Python, JavaScript, Java, C, C++, Go, Ruby, (.bat) and a few more. Currently I focus mainly on web development.",
  "about_modal_paragraph3": "As the saying goes, 'jack of all trades, master of none': I've forgotten much of what I learned, although I still retain some loose memories. In the future, when I achieve a bit more stability, I'd like to code again in some of those technologies. I'll take advantage of my old GitHub projects (some quite outdated, like Flutter apps or various experiments) to resume and update them, and thus transform them into part of my current portfolio, as proof of all my learning beyond work.",
  "about_modal_paragraph4": "By the way, my current GitHub account is relatively recent (it's almost three years old), but I had a previous one linked to an email that wasn't mine and I lost it. Although I didn't use it much, I decided to re-upload the old projects here, some even with improvements. I plan to keep updating that legacy so it becomes part of my story and reflects my evolution as a person and as a professional."
}
