{
  "about_intro_text": "¡Hola! Soy Fravelz, un entusiasta de la tecnología y la programación. Desde que era niño, me ha gustado e interesado el mundo de la informática, la ciberseguridad y el desarrollo de software.",
  "about_history_text": "A los 9 años (2017) recibí mi primera computadora. Al principio la usaba para ver series en YouTube, pero todo cambió cuando descubrí La Geekipedia de Ernesto. Gracias a su canal comencé a aprender Java y pronto logré crear mis primeras interfaces gráficas.",
  "about_current_text": "Actualmente me enfoco en el desarrollo web frontend para proyectos personales y en el hacking ético como preparación laboral. Aunque el hacking siempre me interesó, ahora lo retomo con mayor disciplina y enfoque.",
  "about_modal_title": "Continuación - Mi Historia",
  "about_modal_paragraph1": "También exploré otros de sus cursos, como el de Python y Raptor, lo que me llevó a encontrar aún más recursos y ganas de aprender. Hoy, tras casi 8 años desde ese primer contacto (año 2025), recuerdo todo como si fuera ayer. Aprender informática fue una parte enorme de mi infancia. Aunque a lo largo de los años he explorado áreas muy diferentes y he olvidado muchas cosas, siguen en mí recuerdos vagos de lo aprendido. Me pasa como a los adultos cuando olvidan detalles de su niñez: en mi caso, tengo retazos de conocimientos de informática que aún me acompañan.",
  "about_modal_paragraph2": "Siempre me ha llamado la atención el hacking, pero por la dificultad, el tecnicismo y los recursos limitados en aquel entonces, fui explorando otros campos dentro de la informática.",
  "about_modal_paragraph3": "Las áreas que he explorado son muy variadas: ciencia de datos (pandas, numpy), inteligencia artificial (TensorFlow, Keras), hacking, desarrollo web (HTML, CSS, JS), desarrollo móvil (Flutter), desarrollo de escritorio (PyQt, Tkinter) y programación competitiva (C, C++). También he aprendido distintos lenguajes: Python, JavaScript, Java, C, C++, Go, Ruby, (.bat) y algunos más.",
  "about_modal_paragraph4": "Como dice el dicho, 'el que mucho abarca poco aprieta': he olvidado gran parte de lo que aprendí, aunque aún conservo algunos recuerdos sueltos. En el futuro, cuando logre algo más de estabilidad, me gustaría volver a programar en algunas de esas tecnologías. Aprovecharé mis proyectos antiguos de GitHub (algunos bastante desactualizados, como apps en Flutter o experimentos varios) para retomarlos y actualizarlos, y así transformarlos en parte de mi portfolio actual, como prueba de todo mi aprendizaje más allá de lo laboral.",
  "about_modal_paragraph5": "Por cierto, mi cuenta de GitHub actual es relativamente reciente (ya va para tres años), pero tuve una anterior vinculada a un correo que no era mío y la perdí. Aunque no la usaba tanto, decidí resubir aquí los proyectos antiguos, algunos incluso con mejoras. Pienso seguir actualizando ese legado para que forme parte de mi historia y refleje mi evolución como persona y como profesional."
}
